Revit 2027 API
LightGroup Methods
The LightGroup type exposes the following members.
Methods
Name | Description
AddLight |  Add a new light instance to the group
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLights |  Get the set of contained light instances The set of light instances
GetType | Gets the Type of the current instance.
(Inherited from Object)
RemoveLight |  Remove the given light instance from the set of light instances in this group
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace